In [166]:
# Import modules

import numpy as np
import pandas as pd

In [167]:
# Read the data

data = pd.read_csv("/Users/ioanahancu/Desktop/purchase_data.csv")

In [168]:
# View the data

data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [169]:
# Player count(Total)

player_info = data.loc[:,["Gender", "SN", "Age","Price"]]
player_info.head()

  Gender             SN  Age  Price
0   Male        Lisim78   20   3.53
1   Male    Lisovynya38   40   1.56
2   Male     Ithergue48   24   4.88
3   Male  Chamassasya86   24   3.27
4   Male      Iskosia90   23   1.44

In [170]:
total_players = player_info.count()[0]
total_players

780

In [171]:
# Check if there are duplicates based on SN

final_player_info = player_info.drop_duplicates(subset="SN")

In [172]:
# Final number of total players
final_total_players = final_player_info.count()[0]
final_total_players

576

In [173]:
# Save output as a dataframe:

df_final_total_players=pd.DataFrame({"Total Players": [final_total_players]})
df_final_total_players

   Total Players
0            576

In [145]:
# Purchasing analysis (Total)

unique_item_count = len(data["Item ID"].unique())
average_item_price = data["Price"].mean()
total_revenue = data["Price"].sum()
purchase_count = data["Price"].count()

# Create a DataFrame to hold results
summary_table = pd.DataFrame({"Number of Unique Items": unique_item_count,
                              "Average Purchase Price($)": [average_item_price],
                                "Number of Purchases": [purchase_count],
                                 "Total Revenue($)":[total_revenue]})
summary_table

,Number of Unique Items,Average Purchase Price($),Number of Purchases,Total Revenue($)
0,179,3.050987,780,2379.77

In [174]:
# Gender demographics

gender_demographics_totals = final_player_info["Gender"].value_counts()
gender_demographics_totals
gender_demographics_percents = gender_demographics_totals / 576 * 100
gender_demographics_percents


# Save output as a dataframe
gender_demographics = pd.DataFrame({"Total Count": gender_demographics_totals,
                                    "Percentage of Players": gender_demographics_percents})
gender_demographics = gender_demographics.round(2)
gender_demographics

                       Total Count  Percentage of Players
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91

In [175]:
# Purchasing Analysis (Gender)

gender_counts = data.groupby(["Gender"]).count()["Price"].rename("Purchase Count")
gender_counts
gender_average = data.groupby(["Gender"]).mean()["Price"].rename("Average Purchase Price")
gender_average
gender_purchase_total = data.groupby(["Gender"]).sum()["Price"].rename("Total Purchase Price")
gender_purchase_total

# Calculate normalized Purchasing
average_purchase_total_per_person_gender = gender_purchase_total / gender_demographics["Total Count"]
average_purchase_total_per_person_gender

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [176]:
# Save output as dataframe
gender_data = pd.DataFrame({"Purchase Count": gender_counts, 
                            "Average Purchase Price($)": gender_average,
                            "Total Purchase Price($)": gender_purchase_total, 
                            "Purchase Total per Person by Gender($)": average_purchase_total_per_person_gender})

gender_data

,Purchase Count,Average Purchase Price($),Total Purchase Price($),Purchase Total per Person by Gender($)
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [177]:
# Age Demographics

age_bins = [0, 9.90, 14.90, 19.90, 24.9, 29.9, 34.90, 39.90, 9999999]
age_bins_name = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", ">40"]

#Use Cut to categorize players
data["Age Ranges"] = pd.cut(data["Age"], age_bins, labels=age_bins_name)
data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,>40
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [186]:
age_demographics_totals = data["Age Ranges"].value_counts()
age_demographics_totals
age_demographics_percents = age_demographics_totals / total_players * 100
age_demographics_percents
age_totals = pd.DataFrame({"Total Count": age_demographics_totals,
                          "Percentage of Players": age_demographics_percents})
age_totals

       Total Count  Percentage of Players
20-24          365              46.794872
15-19          136              17.435897
25-29          101              12.948718
30-34           73               9.358974
35-39           41               5.256410
10-14           28               3.589744
<10             23               2.948718
>40             13               1.666667

In [189]:
age_average = data.groupby(["Age Ranges"]).mean()["Price"].rename("Average Purchase Price")
age_average
age_total_purchase=data.groupby(["Age Ranges"]).sum()["Price"].rename("Total Purchase Value")
average_total_purchase_by_group= age_total_purchase/age_demographics_totals

age_demographics = pd.DataFrame({"Purchase Total Count": age_demographics_totals, "Average Purchase Price": age_average, 
                                 "Total Purchase Value": age_total_purchase, "Avg Total Purchase per Person": average_total_purchase_by_group})
age_demographics

,Purchase Total Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
<10,23,3.353478,77.13,3.353478
10-14,28,2.956429,82.78,2.956429
15-19,136,3.035956,412.89,3.035956
20-24,365,3.052219,1114.06,3.052219
25-29,101,2.900990,293.00,2.900990
30-34,73,2.931507,214.00,2.931507
35-39,41,3.601707,147.67,3.601707
>40,13,2.941538,38.24,2.941538

In [190]:
#Top Spenders

user_total = data.groupby(["SN"]).sum()["Price"].rename("Total Purchase Value")
user_average = data.groupby(["SN"]).mean()["Price"].rename("Average Purchase Price")
user_count = data.groupby(["SN"]).count()["Price"].rename("Purchase Count")

user_data = pd.DataFrame({"Total Purchase Amount": user_total,
                          "Average Purchase Price": user_average,
                          "Purchase Count": user_count})

# Convert to Data Frame and sort descending
user_data.sort_values("Total Purchase Amount", ascending=False).head(5)

             Total Purchase Amount  Average Purchase Price  Purchase Count
SN
Lisosia93                    18.96                3.792000               5
Idastidru52                  15.45                3.862500               4
Chamjask73                   13.83                4.610000               3
Iral74                       13.62                3.405000               4
Iskadarya95                  13.10                4.366667               3

In [81]:
# Most Popular Items
item_total_purchase = data.groupby(["Item ID", "Item Name"]).count()["Price"]
item_total_price=data.groupby(["Item ID", "Item Name"]).sum()["Price"]
item_price=item_total_price/item_total_purchase

popular_items=pd.DataFrame({"Purchase Count": item_total_purchase,
                            "Item Price": item_price,
                          "Total Purchase Value": item_total_price})
popular_items.sort_values("Purchase Count", ascending=False).head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

In [191]:
# Most Profitable Items

profitable_items=pd.DataFrame({"Purchase Count": item_total_purchase,
                            "Item Price": item_price,
                          "Total Purchase Value": item_total_price})
profitable_items.sort_values("Total Purchase Value", ascending=False).head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80

In [ ]:
# Written description of three observable trends based on the data

#1. Of the 576 players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

#2. Our peak age demographic falls between 20-24 (46.79%) with secondary groups falling between 15-19 (17.43%) and 25-29 (12.94%).

#3. The age category that spends the most money is the 20-24 with a total purchase value of $1,114.06.